// T1046 - Network Service Scanning
// Detect TCP network scans with multiple ports hit from single host
DeviceNetworkEvents
| summarize PortCount=dcount(RemotePort) by InitiatingProcessAccountName, DeviceName, bin(Timestamp, 10m)
| where PortCount > 20
| project InitiatingProcessAccountName, DeviceName, PortCount, Timestam
