// T1078.004 - OAuth Token Replay
// Finds excessive OAuth token replay attempts
SigninLogs
| where TokenIssuer contains "OAuth"
| summarize cnt=count() by UserPrincipalName, IPAddress
| where cnt > 2
| project UserPrincipalName, IPAddress, cnt
