// T1489 - Service Stop
// Detects attempts to stop security or backup services which could possibly be for ransomware prep
DeviceProcessEvents
| where FileName == "sc.exe"
| where ProcessCommandLine has_any ("stop", "delete", "config")
| where ProcessCommandLine contains_any ("windowsdefender", "backup", "vss")
| project Timestamp, DeviceName, ProcessCommandLine
| order by Timestamp desc
