// T1111 - MFA Token Replay Abuse
// Finds repeated use of MFA tokens for the same user from multiple IPs
SigninLogs
| summarize cnt=count(), distinct_ip=dcount(IPAddress) by UserPrincipalName
| where cnt > 1 and distinct_ip > 1
| project UserPrincipalName, cnt, distinct_ip
