// T1556 - SSO Session Hijack
// Detects SSO session switches between disparate devices
SigninLogs
| summarize by SessionId, UserPrincipalName, DeviceDetail
| where dcount(DeviceDetail) > 1
| project SessionId, UserPrincipalName, DeviceDetai
