//T1003.001 – LSASS Memory Credential Dumping
//  Dumping credentials from LSASS process memory using tools like Mimikatz or ProcDump.
DeviceProcessEvents
| where FileName in ("procdump.exe", "taskmgr.exe", "rundll32.exe", "lsass.exe")
| where ProcessCommandLine contains "lsass"
| project Timestamp, DeviceName, InitiatingProcessFileName, FileName, ProcessCommandLine
| order by Timestamp desc
